---
kind: other
id: Properties.T:Autodesk.Revit.DB.HostObjAttributes
source: html/96733a0a-d8f3-b4b7-7ae0-9a8f17b7e3cb.htm
---
# HostObjAttributes Properties

The id of the assembly instance to which the element belongs.